Tekla.Structures.Plugins.DrawingPluginBase.InputDefinition.InputTypes
The possible input types for a drawing plug-in.

Tekla.Structures.Plugins.DrawingPluginBase.InputDefinition.InputTypes.INPUT_ONE_POINT
The input has one point.

Tekla.Structures.Plugins.DrawingPluginBase.InputDefinition.InputTypes.INPUT_TWO_POINTS
The input has two points.

Tekla.Structures.Plugins.DrawingPluginBase.InputDefinition.InputTypes.INPUT_THREE_POINTS
The input has three points.

Tekla.Structures.Plugins.DrawingPluginBase.InputDefinition.InputTypes.INPUT_N_POINTS
The input has multiple points.

Tekla.Structures.Plugins.DrawingPluginBase.InputDefinition.InputTypes.INPUT_ONE_OBJECT
The input has one drawing object. The supported drawing objects are bolts, parts and rebars.
Bolts, parts and rebars are drawing objects derived from model objects. The parts include the beam, the
contour plate and the polybeam.